public class program {
    public static void main(String[] args) {
        System.out.println("hello world");
        int a = 123;
        var res = --a - a--;
        System.out.println(res); 

        /**
         *Задана натуральная степень k. 
         Сформировать случайным образом список коэффициентов (значение от 0 до 100)
         многочлена многочлен степени k.
         Пример: k=2 => 2*x^2 + 4*x + 5 = 0 или x^2 + 5 = 0 или 10*x^2 = 0
         */

        /**
         * Даны два файла, в каждом из которых находится запись многочлена.
         * Сформировать файл содержащий сумму многочленов.
         */

    }
}

